In [88]:
import pandas as pd

In [89]:
%time
df = pd.read_html('http://www.cbr.ru')[3]
# выводит все таблицы с сайта, здесь 4-я по счету ЦБ

Wall time: 0 ns

In [90]:
%%time
df

Wall time: 0 ns

  рублей за грамм 14.01.2020
0       Золото Au  ↓3 037,92
1      Серебро Ag     ↓35,10
2      Платина Pt  ↓1 896,80
3     Палладий Pd  ↓4 148,27

In [91]:
type(df.values)

numpy.ndarray

In [92]:
df.dtypes.value_counts()

object    2
dtype: int64

* [Аналитикам: большая шпаргалка по Pandas](https://smysl.io/blog/pandas/)

In [93]:
%time
page_url = 'https://www.finanz.ru/valyuty/usd-rub'

# Импортируем нужную нам страницу в df
# attrs = {'class': 'news_table'} ---> указываем какой именно блок нам нужен
# encoding='utf-8' ---> указываем кодировку страниц для корректного отображения кириллицы

df2 = pd.read_html(page_url, attrs = {'class': 'news_table'}, encoding='utf-8')

Wall time: 0 ns

In [94]:
df2[:5]

[       Дата  Закрытие  Открытие  Максимум  Минимум
 0  12.01.20    610595    610595    610595   610095
 1  11.01.20    610245    610245    610245   610245
 2  10.01.20    610245    613000    613850   608833
 3  09.01.20    613012    612395    614041   611216
 4  08.01.20    612250    620030    621430   610750
 5  07.01.20    619792    617997    621105   616100
 6  06.01.20    617835    621980    623450   617420
 7  05.01.20    621990    622745    624995   621985
 8  03.01.20    620695    617327    622355   617142,
        Имя  Unnamed: 1     %    курс                 Дата
 0  EUR/RUB         NaN  5636   68251  13.01.2020 23:47:00
 1  USD/RUB         NaN  3705  612857  13.01.2020 23:47:00
 2  CHF/RUB         NaN  6526  631424  13.01.2020 23:48:00
 3  JPY/RUB         NaN    61    5576  13.01.2020 23:48:00
 4  GBP/RUB         NaN   694  796646  13.01.2020 23:48:00
 5  NOK/RUB         NaN  2986   68921  13.01.2020 23:48:00
 6  AUD/RUB         NaN  4904  423236  13.01.2020 23:48:00
 7  NZD/RUB         NaN  2419  406386  13.01.2020 23:48:00
 8  TRY/RUB         NaN  6156  104521  13.01.2020 23:48:00]

In [95]:
type(df2)

list

In [96]:
len(df2)

2

In [149]:
a = df2[0]
b = df2[1]

print(f'тип первого номера списка:\n',
      {type(a)},
      '\n\nвторой номер списка:\n\n',
      b)

тип первого номера списка:
 {<class 'pandas.core.frame.DataFrame'>}

второй номер списка:

        Имя  Unnamed: 1     %    курс                 Дата
0  EUR/RUB         NaN  5636   68251  13.01.2020 23:47:00
1  USD/RUB         NaN  3705  612857  13.01.2020 23:47:00
2  CHF/RUB         NaN  6526  631424  13.01.2020 23:48:00
3  JPY/RUB         NaN    61    5576  13.01.2020 23:48:00
4  GBP/RUB         NaN   694  796646  13.01.2020 23:48:00
5  NOK/RUB         NaN  2986   68921  13.01.2020 23:48:00
6  AUD/RUB         NaN  4904  423236  13.01.2020 23:48:00
7  NZD/RUB         NaN  2419  406386  13.01.2020 23:48:00
8  TRY/RUB         NaN  6156  104521  13.01.2020 23:48:00

In [98]:
a

       Дата  Закрытие  Открытие  Максимум  Минимум
0  12.01.20    610595    610595    610595   610095
1  11.01.20    610245    610245    610245   610245
2  10.01.20    610245    613000    613850   608833
3  09.01.20    613012    612395    614041   611216
4  08.01.20    612250    620030    621430   610750
5  07.01.20    619792    617997    621105   616100
6  06.01.20    617835    621980    623450   617420
7  05.01.20    621990    622745    624995   621985
8  03.01.20    620695    617327    622355   617142

In [99]:
a.shape

(9, 5)

In [100]:
a.dtypes.value_counts()

int64     4
object    1
dtype: int64

In [101]:
a.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
Дата        9 non-null object
Закрытие    9 non-null int64
Открытие    9 non-null int64
Максимум    9 non-null int64
Минимум     9 non-null int64
dtypes: int64(4), object(1)
memory usage: 440.0+ bytes

In [102]:
# экспресс-расчет распределения числовых значений

a.describe()

            Закрытие       Открытие       Максимум        Минимум
count       9.000000       9.000000       9.000000       9.000000
mean   615184.333333  616257.111111  618007.333333  613754.000000
std      4849.310827    4834.516301    5775.749107    4521.535138
min    610245.000000  610245.000000  610245.000000  608833.000000
25%    610595.000000  612395.000000  613850.000000  610245.000000
50%    613012.000000  617327.000000  621105.000000  611216.000000
75%    619792.000000  620030.000000  622355.000000  617142.000000
max    621990.000000  622745.000000  624995.000000  621985.000000

## Структуры данных: серии и датафреймы


**Серии — одномерные массивы данных. Они очень похожи на списки, но отличаются по поведению — например, операции применяются к списку целиком, а в сериях — поэлементно.**


То есть, если список умножить на 2, получите тот же список, повторенный 2 раза.

In [103]:
vector = [1, 2, 3]
vector * 2

[1, 2, 3, 1, 2, 3]

А если умножить серию, ее длина не изменится, а вот элементы удвоятся.

In [104]:
series = pd.Series([1, 2, 3])
series * 2

0    2
1    4
2    6
dtype: int64

In [105]:
months = ['jan', 'feb', 'mar', 'apr']
sales = [100, 200, 300, 400]
data = pd.Series(data=sales, index=months)
data

jan    100
feb    200
mar    300
apr    400
dtype: int64

In [106]:
 data['feb']

200

#### Вернемся к `a` и `b`

In [107]:
a

       Дата  Закрытие  Открытие  Максимум  Минимум
0  12.01.20    610595    610595    610595   610095
1  11.01.20    610245    610245    610245   610245
2  10.01.20    610245    613000    613850   608833
3  09.01.20    613012    612395    614041   611216
4  08.01.20    612250    620030    621430   610750
5  07.01.20    619792    617997    621105   616100
6  06.01.20    617835    621980    623450   617420
7  05.01.20    621990    622745    624995   621985
8  03.01.20    620695    617327    622355   617142

In [108]:
b

       Имя  Unnamed: 1     %    курс                 Дата
0  EUR/RUB         NaN  5636   68251  13.01.2020 23:47:00
1  USD/RUB         NaN  3705  612857  13.01.2020 23:47:00
2  CHF/RUB         NaN  6526  631424  13.01.2020 23:48:00
3  JPY/RUB         NaN    61    5576  13.01.2020 23:48:00
4  GBP/RUB         NaN   694  796646  13.01.2020 23:48:00
5  NOK/RUB         NaN  2986   68921  13.01.2020 23:48:00
6  AUD/RUB         NaN  4904  423236  13.01.2020 23:48:00
7  NZD/RUB         NaN  2419  406386  13.01.2020 23:48:00
8  TRY/RUB         NaN  6156  104521  13.01.2020 23:48:00

In [109]:
b.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
Имя           9 non-null object
Unnamed: 1    0 non-null float64
%             9 non-null int64
курс          9 non-null int64
Дата          9 non-null object
dtypes: float64(1), int64(2), object(2)
memory usage: 440.0+ bytes

Чтобы выбрать строки, значение столбца которых равно скаляру, `some_value`, используйте `==`

In [110]:
b.loc[b['Имя'] == 'NOK/RUB']

       Имя  Unnamed: 1     %   курс                 Дата
5  NOK/RUB         NaN  2986  68921  13.01.2020 23:48:00

In [111]:
b[b['курс'] < 300000]

       Имя  Unnamed: 1     %    курс                 Дата
0  EUR/RUB         NaN  5636   68251  13.01.2020 23:47:00
3  JPY/RUB         NaN    61    5576  13.01.2020 23:48:00
5  NOK/RUB         NaN  2986   68921  13.01.2020 23:48:00
8  TRY/RUB         NaN  6156  104521  13.01.2020 23:48:00

Чтобы выбрать строки, чье значение столбца находится в итерируемой `some_values`, используйте `isin`.


Значения подаются в списке.

In [112]:
b.loc[b['Имя'].isin(['NOK/RUB', 'USD/RUB', 'NZD/RUB'])]

       Имя  Unnamed: 1     %    курс                 Дата
1  USD/RUB         NaN  3705  612857  13.01.2020 23:47:00
5  NOK/RUB         NaN  2986   68921  13.01.2020 23:48:00
7  NZD/RUB         NaN  2419  406386  13.01.2020 23:48:00

### [дальше](https://overcoder.net/q/3301/%D0%B2%D1%8B%D0%B1%D0%B5%D1%80%D0%B8%D1%82%D0%B5-%D1%81%D1%82%D1%80%D0%BE%D0%BA%D0%B8-%D0%B2-dataframe-%D0%BD%D0%B0-%D0%BE%D1%81%D0%BD%D0%BE%D0%B2%D0%B5-%D0%B7%D0%BD%D0%B0%D1%87%D0%B5%D0%BD%D0%B8%D0%B9-%D0%B2-%D1%81%D1%82%D0%BE%D0%BB%D0%B1%D1%86%D0%B5-%D0%B2-%D0%BF%D0%B0%D0%BD%D0%B4%D0%B0%D1%85)

[Get all rows in a Pandas DataFrame containing given substring](https://www.geeksforgeeks.org/get-all-rows-in-a-pandas-dataframe-containing-given-substring/)

In [150]:
new_b = b[b['Имя'].str.contains("RUB")]
new_b

       Имя  Unnamed: 1     %    курс                 Дата
0  EUR/RUB         NaN  5636   68251  13.01.2020 23:47:00
1  USD/RUB         NaN  3705  612857  13.01.2020 23:47:00
2  CHF/RUB         NaN  6526  631424  13.01.2020 23:48:00
3  JPY/RUB         NaN    61    5576  13.01.2020 23:48:00
4  GBP/RUB         NaN   694  796646  13.01.2020 23:48:00
5  NOK/RUB         NaN  2986   68921  13.01.2020 23:48:00
6  AUD/RUB         NaN  4904  423236  13.01.2020 23:48:00
7  NZD/RUB         NaN  2419  406386  13.01.2020 23:48:00
8  TRY/RUB         NaN  6156  104521  13.01.2020 23:48:00

In [157]:
no_b = b[b['Имя'].str.contains('GBP')]
no_b

       Имя  Unnamed: 1    %    курс                 Дата
4  GBP/RUB         NaN  694  796646  13.01.2020 23:48:00

[Using iloc, loc, & ix to select rows and columns in Pandas DataFrames](https://www.shanelynn.ie/select-pandas-dataframe-rows-and-columns-using-iloc-loc-and-ix/)

[How To Filter Pandas Dataframe By Values of Column?](https://cmdlinetips.com/2018/02/how-to-subset-pandas-dataframe-based-on-values-of-a-column/)

[Indexing and Selecting Data with Pandas](https://www.geeksforgeeks.org/indexing-and-selecting-data-with-pandas/)

[How to apply a function to two columns of Pandas dataframe](https://stackoverflow.com/questions/13331698/how-to-apply-a-function-to-two-columns-of-pandas-dataframe)

[Get column name where value is something in pandas dataframe](https://stackoverflow.com/questions/14734695/get-column-name-where-value-is-something-in-pandas-dataframe)

[Pandas: Apply a function to single or selected columns or rows in Dataframe](https://thispointer.com/pandas-apply-a-function-to-single-or-selected-columns-or-rows-in-dataframe/)

[Select by partial string from a pandas DataFrame](https://stackoverflow.com/questions/11350770/select-by-partial-string-from-a-pandas-dataframe)

## Функция, чтобы достать названия столюцов соответствующих значению:

исходный код с устаревшим синтаксисом [здесь](https://stackoverflow.com/questions/14734695/get-column-name-where-value-is-something-in-pandas-dataframe)

In [114]:
import pandas as pd
df = pd.DataFrame({'user_id': [1, 2, 3], 'clicks': [163, 130, 97], 'order': [2, 4, 0],'orders2': [0, 1, 1]})
df

   user_id  clicks  order  orders2
0        1     163      2        0
1        2     130      4        1
2        3      97      0        1

In [115]:
df_result = pd.DataFrame({'value': [2,1,0]})

In [116]:
df_result

   value
0      2
1      1
2      0

In [117]:
def get_col_name(row):    
    b = (df.iloc[row.name] == row['value'])
    return b.idxmax()

In [118]:
df_result['Column'] = df_result.apply(get_col_name, axis=1)

In [119]:
# здача решена:
df_result

   value   Column
0      2    order
1      1  orders2
2      0    order

#### детальное описание:

In [120]:
row = df_result.iloc[0]
row

value         2
Column    order
Name: 0, dtype: object

In [121]:
row.name

0

In [122]:
df.iloc[row.name]

user_id      1
clicks     163
order        2
orders2      0
Name: 0, dtype: int64

In [123]:
b = (df.iloc[row.name] == row['value'])
b

user_id    False
clicks     False
order       True
orders2    False
Name: 0, dtype: bool

In [124]:
b.idxmax()

'order'